import numpy as np
import pandas as pd

! pip install xlrd

x1 = pd.read_excel("C:/Users/USER/Downloads/1_지역별종별요양기관수현황.xls")
x1
상급종합병원수 = x1["상급종합병원"]
종합병원수 = x1["종합병원"]
병원수 = x1["병원"]

x2 = pd.read_excel("C:/Users/USER/Downloads/1_지역별의원표시과목별현황.xls")
심장혈관흉부외과의원수 = x2["심장혈관흉부외과"]

x3 = pd.read_excel("C:/Users/USER/Downloads/1_지역별종별의료인력현황1.xls")
일반의수 = x3["일반의"]
전문의수 = x3["전문의"]

x4 = pd.read_excel("C:/Users/USER/Downloads/1_지역별종별의료인력현황2.xls")
간호사수 = x4["간호사"]
임상병리사수 = x4["임상병리사"]

x5 = pd.read_excel("C:/Users/USER/Downloads/1_지역별종별전문과목별전문의현황.xls")
심장혈관흉부외과수 = x5["심장혈관흉부외과"]

x6 = pd.read_excel("C:/Users/USER/Downloads/1_지역별종별입원실현황.xls")
x6_서울일반병실 = x6.loc[2:4, ["일반입원실","일반입원실.2"]]
x6_서울일반병상 = x6.loc[2:4, ["일반입원실.1","일반입원실.3"]]
x6_서울중환병실 = x6.loc[2:4, ["중환자실","중환자실.2", "중환자실.4"]]
x6_서울중환병상 = x6.loc[2:4, ["중환자실.1","중환자실.3", "중환자실.5"]]

x6_부산일반병실 = x6.loc[13:15, ["일반입원실","일반입원실.2"]]
x6_부산일반병상 = x6.loc[13:15, ["일반입원실.1","일반입원실.3"]]
x6_부산중환병실 = x6.loc[13:15, ["중환자실","중환자실.2", "중환자실.4"]]
x6_부산중환병상 = x6.loc[13:15, ["중환자실.1","중환자실.3", "중환자실.5"]]

x6_인천일반병실 = x6.loc[23:25, ["일반입원실","일반입원실.2"]]
x6_인천일반병상 = x6.loc[23:25, ["일반입원실.1","일반입원실.3"]]
x6_인천중환병실 = x6.loc[23:25, ["중환자실","중환자실.2", "중환자실.4"]]
x6_인천중환병상 = x6.loc[23:25, ["중환자실.1","중환자실.3", "중환자실.5"]]

x6_대구일반병실 = x6.loc[32:34, ["일반입원실","일반입원실.2"]]
x6_대구일반병상 = x6.loc[32:34, ["일반입원실.1","일반입원실.3"]]
x6_대구중환병실 = x6.loc[32:34, ["중환자실","중환자실.2", "중환자실.4"]]
x6_대구중환병상 = x6.loc[32:34, ["중환자실.1","중환자실.3", "중환자실.5"]]

x6_광주일반병실 = x6.loc[42:44, ["일반입원실","일반입원실.2"]]
x6_광주일반병상 = x6.loc[42:44, ["일반입원실.1","일반입원실.3"]]
x6_광주중환병실 = x6.loc[42:44, ["중환자실","중환자실.2", "중환자실.4"]]
x6_광주중환병상 = x6.loc[42:44, ["중환자실.1","중환자실.3", "중환자실.5"]]

x6_대전일반병실 = x6.loc[51:53, ["일반입원실","일반입원실.2"]]
x6_대전일반병상 = x6.loc[51:53, ["일반입원실.1","일반입원실.3"]]
x6_대전중환병실 = x6.loc[51:53, ["중환자실","중환자실.2", "중환자실.4"]]
x6_대전중환병상 = x6.loc[51:53, ["중환자실.1","중환자실.3", "중환자실.5"]]

x6_울산일반병실 = x6.loc[62:64, ["일반입원실","일반입원실.2"]]
x6_울산일반병상 = x6.loc[62:64, ["일반입원실.1","일반입원실.3"]]
x6_울산중환병실 = x6.loc[62:64, ["중환자실","중환자실.2", "중환자실.4"]]
x6_울산중환병상 = x6.loc[62:64, ["중환자실.1","중환자실.3", "중환자실.5"]]

x6_경기일반병실 = x6.loc[72:74, ["일반입원실","일반입원실.2"]]
x6_경기일반병상 = x6.loc[72:74, ["일반입원실.1","일반입원실.3"]]
x6_경기중환병실 = x6.loc[72:74, ["중환자실","중환자실.2", "중환자실.4"]]
x6_경기중환병상 = x6.loc[72:74, ["중환자실.1","중환자실.3", "중환자실.5"]]

x6_강원일반병실 = x6.loc[84:86, ["일반입원실","일반입원실.2"]]
x6_강원일반병상 = x6.loc[84:86, ["일반입원실.1","일반입원실.3"]]
x6_강원중환병실 = x6.loc[84:86, ["중환자실","중환자실.2", "중환자실.4"]]
x6_강원중환병상 = x6.loc[84:86, ["중환자실.1","중환자실.3", "중환자실.5"]]

x6_충북일반병실 = x6.loc[94:96, ["일반입원실","일반입원실.2"]]
x6_충북일반병상 = x6.loc[94:96, ["일반입원실.1","일반입원실.3"]]
x6_충북중환병실 = x6.loc[94:96, ["중환자실","중환자실.2", "중환자실.4"]]
x6_충북중환병상 = x6.loc[94:96, ["중환자실.1","중환자실.3", "중환자실.5"]]

x6_충남일반병실 = x6.loc[103:105, ["일반입원실","일반입원실.2"]]
x6_충남일반병상 = x6.loc[103:105, ["일반입원실.1","일반입원실.3"]]
x6_충남중환병실 = x6.loc[103:105, ["중환자실","중환자실.2", "중환자실.4"]]
x6_충남중환병상 = x6.loc[103:105, ["중환자실.1","중환자실.3", "중환자실.5"]]

x6_충남일반병실 = x6.loc[103:105, ["일반입원실","일반입원실.2"]]
x6_충남일반병상 = x6.loc[103:105, ["일반입원실.1","일반입원실.3"]]
x6_충남중환병실 = x6.loc[103:105, ["중환자실","중환자실.2", "중환자실.4"]]
x6_충남중환병상 = x6.loc[103:105, ["중환자실.1","중환자실.3", "중환자실.5"]]

x6_전북일반병실 = x6.loc[113:115, ["일반입원실","일반입원실.2"]]
x6_전북일반병상 = x6.loc[113:115, ["일반입원실.1","일반입원실.3"]]
x6_전북중환병실 = x6.loc[113:115, ["중환자실","중환자실.2", "중환자실.4"]]
x6_전북중환병상 = x6.loc[113:115, ["중환자실.1","중환자실.3", "중환자실.5"]]

x6_전남일반병실 = x6.loc[124:126, ["일반입원실","일반입원실.2"]]
x6_전남일반병상 = x6.loc[124:126, ["일반입원실.1","일반입원실.3"]]
x6_전남중환병실 = x6.loc[124:126, ["중환자실","중환자실.2", "중환자실.4"]]
x6_전남중환병상 = x6.loc[124:126, ["중환자실.1","중환자실.3", "중환자실.5"]]

x6_경북일반병실 = x6.loc[133:135, ["일반입원실","일반입원실.2"]]
x6_경북일반병상 = x6.loc[133:135, ["일반입원실.1","일반입원실.3"]]
x6_경북중환병실 = x6.loc[133:135, ["중환자실","중환자실.2", "중환자실.4"]]
x6_경북중환병상 = x6.loc[133:135, ["중환자실.1","중환자실.3", "중환자실.5"]]

x6_경남일반병실 = x6.loc[142:144, ["일반입원실","일반입원실.2"]]
x6_경남일반병상 = x6.loc[142:144, ["일반입원실.1","일반입원실.3"]]
x6_경남중환병실 = x6.loc[142:144, ["중환자실","중환자실.2", "중환자실.4"]]
x6_경남중환병상 = x6.loc[142:144, ["중환자실.1","중환자실.3", "중환자실.5"]]

x6_제주일반병실 = x6.loc[152:154, ["일반입원실","일반입원실.2"]]
x6_제주일반병상 = x6.loc[152:154, ["일반입원실.1","일반입원실.3"]]
x6_제주중환병실 = x6.loc[152:154, ["중환자실","중환자실.2", "중환자실.4"]]
x6_제주중환병상 = x6.loc[152:154, ["중환자실.1","중환자실.3", "중환자실.5"]]

x6_세종일반병실 = x6.loc[159:161, ["일반입원실","일반입원실.2"]]
x6_세종일반병상 = x6.loc[159:161, ["일반입원실.1","일반입원실.3"]]
x6_세종중환병실 = x6.loc[159:161, ["중환자실","중환자실.2", "중환자실.4"]]
x6_세종중환병상 = x6.loc[159:161, ["중환자실.1","중환자실.3", "중환자실.5"]]