import numpy as np
import pandas as pd

# !pip install xlrd

x1 = pd.read_excel("C:/Users/USER/Downloads/1_지역별종별요양기관수현황.xls")
x1
상급종합병원수 = x1["상급종합병원"]
종합병원수 = x1["종합병원"]
병원수 = x1["병원"]

x2 = pd.read_excel("C:/Users/USER/Downloads/1_지역별의원표시과목별현황.xls")
심장혈관흉부외과의원수 = x2["심장혈관흉부외과"]

x3 = pd.read_excel("C:/Users/USER/Downloads/1_지역별종별의료인력현황1.xls")
일반의수 = x3["일반의"]
전문의수 = x3["전문의"]

x4 = pd.read_excel("C:/Users/USER/Downloads/1_지역별종별의료인력현황2.xls")
간호사수 = x4["간호사"]
임상병리사수 = x4["임상병리사"]

x5 = pd.read_excel("C:/Users/USER/Downloads/1_지역별종별전문과목별전문의현황.xls")
심장혈관흉부외과수 = x5["심장혈관흉부외과"]

x6 = pd.read_excel("C:/Users/USER/Downloads/1_지역별종별입원실현황.xls")
x6_서울일반병실 = x6.loc[2:4, ["일반입원실","일반입원실.2"]]
x6_서울일반병상 = x6.loc[2:4, ["일반입원실.1","일반입원실.3"]]
x6_서울중환병실 = x6.loc[2:4, ["중환자실","중환자실.2", "중환자실.4"]]
x6_서울중환병상 = x6.loc[2:4, ["중환자실.1","중환자실.3", "중환자실.5"]]

x6_부산일반병실 = x6.loc[13:15, ["일반입원실","일반입원실.2"]]
x6_부산일반병상 = x6.loc[13:15, ["일반입원실.1","일반입원실.3"]]
x6_부산중환병실 = x6.loc[13:15, ["중환자실","중환자실.2", "중환자실.4"]]
x6_부산중환병상 = x6.loc[13:15, ["중환자실.1","중환자실.3", "중환자실.5"]]

x6_인천일반병실 = x6.loc[23:25, ["일반입원실","일반입원실.2"]]
x6_인천일반병상 = x6.loc[23:25, ["일반입원실.1","일반입원실.3"]]
x6_인천중환병실 = x6.loc[23:25, ["중환자실","중환자실.2", "중환자실.4"]]
x6_인천중환병상 = x6.loc[23:25, ["중환자실.1","중환자실.3", "중환자실.5"]]

x6_대구일반병실 = x6.loc[32:34, ["일반입원실","일반입원실.2"]]
x6_대구일반병상 = x6.loc[32:34, ["일반입원실.1","일반입원실.3"]]
x6_대구중환병실 = x6.loc[32:34, ["중환자실","중환자실.2", "중환자실.4"]]
x6_대구중환병상 = x6.loc[32:34, ["중환자실.1","중환자실.3", "중환자실.5"]]

x6_광주일반병실 = x6.loc[42:44, ["일반입원실","일반입원실.2"]]
x6_광주일반병상 = x6.loc[42:44, ["일반입원실.1","일반입원실.3"]]
x6_광주중환병실 = x6.loc[42:44, ["중환자실","중환자실.2", "중환자실.4"]]
x6_광주중환병상 = x6.loc[42:44, ["중환자실.1","중환자실.3", "중환자실.5"]]

x6_대전일반병실 = x6.loc[51:53, ["일반입원실","일반입원실.2"]]
x6_대전일반병상 = x6.loc[51:53, ["일반입원실.1","일반입원실.3"]]
x6_대전중환병실 = x6.loc[51:53, ["중환자실","중환자실.2", "중환자실.4"]]
x6_대전중환병상 = x6.loc[51:53, ["중환자실.1","중환자실.3", "중환자실.5"]]

x6_울산일반병실 = x6.loc[62:64, ["일반입원실","일반입원실.2"]]
x6_울산일반병상 = x6.loc[62:64, ["일반입원실.1","일반입원실.3"]]
x6_울산중환병실 = x6.loc[62:64, ["중환자실","중환자실.2", "중환자실.4"]]
x6_울산중환병상 = x6.loc[62:64, ["중환자실.1","중환자실.3", "중환자실.5"]]

x6_경기일반병실 = x6.loc[72:74, ["일반입원실","일반입원실.2"]]
x6_경기일반병상 = x6.loc[72:74, ["일반입원실.1","일반입원실.3"]]
x6_경기중환병실 = x6.loc[72:74, ["중환자실","중환자실.2", "중환자실.4"]]
x6_경기중환병상 = x6.loc[72:74, ["중환자실.1","중환자실.3", "중환자실.5"]]

x6_강원일반병실 = x6.loc[84:86, ["일반입원실","일반입원실.2"]]
x6_강원일반병상 = x6.loc[84:86, ["일반입원실.1","일반입원실.3"]]
x6_강원중환병실 = x6.loc[84:86, ["중환자실","중환자실.2", "중환자실.4"]]
x6_강원중환병상 = x6.loc[84:86, ["중환자실.1","중환자실.3", "중환자실.5"]]

x6_충북일반병실 = x6.loc[94:96, ["일반입원실","일반입원실.2"]]
x6_충북일반병상 = x6.loc[94:96, ["일반입원실.1","일반입원실.3"]]
x6_충북중환병실 = x6.loc[94:96, ["중환자실","중환자실.2", "중환자실.4"]]
x6_충북중환병상 = x6.loc[94:96, ["중환자실.1","중환자실.3", "중환자실.5"]]

x6_충남일반병실 = x6.loc[103:105, ["일반입원실","일반입원실.2"]]
x6_충남일반병상 = x6.loc[103:105, ["일반입원실.1","일반입원실.3"]]
x6_충남중환병실 = x6.loc[103:105, ["중환자실","중환자실.2", "중환자실.4"]]
x6_충남중환병상 = x6.loc[103:105, ["중환자실.1","중환자실.3", "중환자실.5"]]


x6_전북일반병실 = x6.loc[113:115, ["일반입원실","일반입원실.2"]]
x6_전북일반병상 = x6.loc[113:115, ["일반입원실.1","일반입원실.3"]]
x6_전북중환병실 = x6.loc[113:115, ["중환자실","중환자실.2", "중환자실.4"]]
x6_전북중환병상 = x6.loc[113:115, ["중환자실.1","중환자실.3", "중환자실.5"]]

x6_전남일반병실 = x6.loc[124:126, ["일반입원실","일반입원실.2"]]
x6_전남일반병상 = x6.loc[124:126, ["일반입원실.1","일반입원실.3"]]
x6_전남중환병실 = x6.loc[124:126, ["중환자실","중환자실.2", "중환자실.4"]]
x6_전남중환병상 = x6.loc[124:126, ["중환자실.1","중환자실.3", "중환자실.5"]]

x6_경북일반병실 = x6.loc[133:135, ["일반입원실","일반입원실.2"]]
x6_경북일반병상 = x6.loc[133:135, ["일반입원실.1","일반입원실.3"]]
x6_경북중환병실 = x6.loc[133:135, ["중환자실","중환자실.2", "중환자실.4"]]
x6_경북중환병상 = x6.loc[133:135, ["중환자실.1","중환자실.3", "중환자실.5"]]

x6_경남일반병실 = x6.loc[142:144, ["일반입원실","일반입원실.2"]]
x6_경남일반병상 = x6.loc[142:144, ["일반입원실.1","일반입원실.3"]]
x6_경남중환병실 = x6.loc[142:144, ["중환자실","중환자실.2", "중환자실.4"]]
x6_경남중환병상 = x6.loc[142:144, ["중환자실.1","중환자실.3", "중환자실.5"]]

x6_제주일반병실 = x6.loc[152:154, ["일반입원실","일반입원실.2"]]
x6_제주일반병상 = x6.loc[152:154, ["일반입원실.1","일반입원실.3"]]
x6_제주중환병실 = x6.loc[152:154, ["중환자실","중환자실.2", "중환자실.4"]]
x6_제주중환병상 = x6.loc[152:154, ["중환자실.1","중환자실.3", "중환자실.5"]]

x6_세종일반병실 = x6.loc[159:161, ["일반입원실","일반입원실.2"]]
x6_세종일반병상 = x6.loc[159:161, ["일반입원실.1","일반입원실.3"]]
x6_세종중환병실 = x6.loc[159:161, ["중환자실","중환자실.2", "중환자실.4"]]




# 일반병실/병상 합계
def change_to_int(col_list, start, end):
    result = 0
    for col in col_list:
        result = result + x6.loc[start:end, col].str.replace(",","").astype("int64")
    return result

서울일반병실 = change_to_int(["일반입원실","일반입원실.2"], 2, 4)
부산일반병실 = change_to_int(["일반입원실","일반입원실.2"], 13, 15)
인천일반병실 = change_to_int(["일반입원실","일반입원실.2"], 23, 25)
대구일반병실 = change_to_int(["일반입원실","일반입원실.2"], 32, 34)
광주일반병실 = change_to_int(["일반입원실","일반입원실.2"], 42, 44)
대전일반병실 = change_to_int(["일반입원실","일반입원실.2"], 51, 53)
울산일반병실 = change_to_int(["일반입원실","일반입원실.2"], 62, 64)
경기일반병실 = change_to_int(["일반입원실","일반입원실.2"], 72, 74)
강원일반병실 = change_to_int(["일반입원실","일반입원실.2"], 84, 86)
충북일반병실 = change_to_int(["일반입원실","일반입원실.2"], 94, 96)
충남일반병실 = change_to_int(["일반입원실","일반입원실.2"], 103, 105)
전북일반병실 = change_to_int(["일반입원실","일반입원실.2"], 113, 115)
전남일반병실 = change_to_int(["일반입원실","일반입원실.2"], 124, 126)
경북일반병실 = change_to_int(["일반입원실","일반입원실.2"], 133, 135)
경남일반병실 = change_to_int(["일반입원실","일반입원실.2"], 142, 144)
제주일반병실 = change_to_int(["일반입원실","일반입원실.2"], 152, 154)
세종일반병실 = change_to_int(["일반입원실","일반입원실.2"], 159, 161)

서울 = 서울일반병실.sum()
부산 = 부산일반병실.sum()
인천 = 인천일반병실.sum()
대구 = 대구일반병실.sum()
광주 = 광주일반병실.sum()
대전 = 대전일반병실.sum()
울산 = 울산일반병실.sum()
경기 = 경기일반병실.sum()
강원 = 강원일반병실.sum()
충북 = 충북일반병실.sum()
충남 = 충남일반병실.sum()
전북 = 전북일반병실.sum()
전남 = 전남일반병실.sum()
경북 = 경북일반병실.sum()
경남 = 경남일반병실.sum()
제주 = 제주일반병실.sum()
세종 = 세종일반병실.sum()

일반병실 = pd.DataFrame([서울, 부산, 인천, 대구, 광주, 대전, 울산, 경기, 
                     강원, 충북, 충남, 전북, 전남, 경북, 경남, 제주, 세종])
일반병실.columns = ["일반병실"]

    
서울일반병상 = change_to_int(["일반입원실.1","일반입원실.3"], 2, 4)
부산일반병상 = change_to_int(["일반입원실.1","일반입원실.3"], 13, 15)
인천일반병상 = change_to_int(["일반입원실.1","일반입원실.3"], 23, 25)
대구일반병상 = change_to_int(["일반입원실.1","일반입원실.3"], 32, 34)
광주일반병상 = change_to_int(["일반입원실.1","일반입원실.3"], 42, 44)
대전일반병상 = change_to_int(["일반입원실.1","일반입원실.3"], 51, 53)
울산일반병상 = change_to_int(["일반입원실.1","일반입원실.3"], 62, 64)
경기일반병상 = change_to_int(["일반입원실.1","일반입원실.3"], 72, 74)
강원일반병상 = change_to_int(["일반입원실.1","일반입원실.3"], 84, 86)
충북일반병상 = change_to_int(["일반입원실.1","일반입원실.3"], 94, 96)
충남일반병상 = change_to_int(["일반입원실.1","일반입원실.3"], 103, 105)
전북일반병상 = change_to_int(["일반입원실.1","일반입원실.3"], 113, 115)
전남일반병상 = change_to_int(["일반입원실.1","일반입원실.3"], 124, 126)
경북일반병상 = change_to_int(["일반입원실.1","일반입원실.3"], 133, 135)
경남일반병상 = change_to_int(["일반입원실.1","일반입원실.3"], 142, 144)
제주일반병상 = change_to_int(["일반입원실.1","일반입원실.3"], 152, 154)
세종일반병상 = change_to_int(["일반입원실.1","일반입원실.3"], 159, 161)

서울 = 서울일반병상.sum()
부산 = 부산일반병상.sum()
인천 = 인천일반병상.sum()
대구 = 대구일반병상.sum()
광주 = 광주일반병상.sum()
대전 = 대전일반병상.sum()
울산 = 울산일반병상.sum()
경기 = 경기일반병상.sum()
강원 = 강원일반병상.sum()
충북 = 충북일반병상.sum()
충남 = 충남일반병상.sum()
전북 = 전북일반병상.sum()
전남 = 전남일반병상.sum()
경북 = 경북일반병상.sum()
경남 = 경남일반병상.sum()
제주 = 제주일반병상.sum()
세종 = 세종일반병상.sum()

일반병상 = pd.DataFrame([서울, 부산, 인천, 대구, 광주, 대전, 울산, 경기, 
                     강원, 충북, 충남, 전북, 전남, 경북, 경남, 제주, 세종])
일반병상.columns = ["일반병상"]


# 중환병실/병상 합계
def change_to_int(col_list, start, end):
    result = 0
    for col in col_list:
        result = result + x6.loc[start:end, col].str.replace(",","").replace("-", "0").astype("int64")
    return result

서울중환병실 = change_to_int(["중환자실","중환자실.2", "중환자실.4"], 2, 4)
부산중환병실 = change_to_int(["중환자실","중환자실.2", "중환자실.4"], 13, 15)
인천중환병실 = change_to_int(["중환자실","중환자실.2", "중환자실.4"], 23, 25)
대구중환병실 = change_to_int(["중환자실","중환자실.2", "중환자실.4"], 32, 34)
광주중환병실 = change_to_int(["중환자실","중환자실.2", "중환자실.4"], 42, 44)
대전중환병실 = change_to_int(["중환자실","중환자실.2", "중환자실.4"], 51, 53)
울산중환병실 = change_to_int(["중환자실","중환자실.2", "중환자실.4"], 62, 64)
경기중환병실 = change_to_int(["중환자실","중환자실.2", "중환자실.4"], 72, 74)
강원중환병실 = change_to_int(["중환자실","중환자실.2", "중환자실.4"],  84, 86)
충북중환병실 = change_to_int(["중환자실","중환자실.2", "중환자실.4"], 94, 96)
충남중환병실 = change_to_int(["중환자실","중환자실.2", "중환자실.4"], 103, 105)
전북중환병실 = change_to_int(["중환자실","중환자실.2", "중환자실.4"], 113, 115)
전남중환병실 = change_to_int(["중환자실","중환자실.2", "중환자실.4"], 124, 126)
경북중환병실 = change_to_int(["중환자실","중환자실.2", "중환자실.4"], 133, 135)
경남중환병실 = change_to_int(["중환자실","중환자실.2", "중환자실.4"], 142, 144)
제주중환병실 = change_to_int(["중환자실","중환자실.2", "중환자실.4"], 152, 154)
세종중환병실 = change_to_int(["중환자실","중환자실.2", "중환자실.4"], 159, 161)

서울 = 서울중환병실.sum()
부산 = 부산중환병실.sum()
인천 = 인천중환병실.sum()
대구 = 대구중환병실.sum()
광주 = 광주중환병실.sum()
대전 = 대전중환병실.sum()
울산 = 울산중환병실.sum()
경기 = 경기중환병실.sum()
강원 = 강원중환병실.sum()
충북 = 충북중환병실.sum()
충남 = 충남중환병실.sum()
전북 = 전북중환병실.sum()
전남 = 전남중환병실.sum()
경북 = 경북중환병실.sum()
경남 = 경남중환병실.sum()
제주 = 제주중환병실.sum()
세종 = 세종중환병실.sum()

중환병실 = pd.DataFrame([서울, 부산, 인천, 대구, 광주, 대전, 울산, 경기, 
                     강원, 충북, 충남, 전북, 전남, 경북, 경남, 제주, 세종])
중환병실.columns = ["중환병실"]


서울중환병상 = change_to_int(["중환자실.1","중환자실.3", "중환자실.5"], 2, 4)
부산중환병상 = change_to_int(["중환자실.1","중환자실.3", "중환자실.5"], 13, 15)
인천중환병상 = change_to_int(["중환자실.1","중환자실.3", "중환자실.5"], 23, 25)
대구중환병상 = change_to_int(["중환자실.1","중환자실.3", "중환자실.5"], 32, 34)
광주중환병상 = change_to_int(["중환자실.1","중환자실.3", "중환자실.5"], 42, 44)
대전중환병상 = change_to_int(["중환자실.1","중환자실.3", "중환자실.5"], 51, 53)
울산중환병상 = change_to_int(["중환자실.1","중환자실.3", "중환자실.5"], 62, 64)
경기중환병상 = change_to_int(["중환자실.1","중환자실.3", "중환자실.5"], 72, 74)
강원중환병상 = change_to_int(["중환자실.1","중환자실.3", "중환자실.5"],  84, 86)
충북중환병상 = change_to_int(["중환자실.1","중환자실.3", "중환자실.5"], 94, 96)
충남중환병상 = change_to_int(["중환자실.1","중환자실.3", "중환자실.5"], 103, 105)
전북중환병상 = change_to_int(["중환자실.1","중환자실.3", "중환자실.5"], 113, 115)
전남중환병상 = change_to_int(["중환자실.1","중환자실.3", "중환자실.5"], 124, 126)
경북중환병상 = change_to_int(["중환자실.1","중환자실.3", "중환자실.5"], 133, 135)
경남중환병상 = change_to_int(["중환자실.1","중환자실.3", "중환자실.5"], 142, 144)
제주중환병상 = change_to_int(["중환자실.1","중환자실.3", "중환자실.5"], 152, 154)
세종중환병상 = change_to_int(["중환자실.1","중환자실.3", "중환자실.5"], 159, 161)

서울 = 서울중환병상.sum()
부산 = 부산중환병상.sum()
인천 = 인천중환병상.sum()
대구 = 대구중환병상.sum()
광주 = 광주중환병상.sum()
대전 = 대전중환병상.sum()
울산 = 울산중환병상.sum()
경기 = 경기중환병상.sum()
강원 = 강원중환병상.sum()
충북 = 충북중환병상.sum()
충남 = 충남중환병상.sum()
전북 = 전북중환병상.sum()
전남 = 전남중환병상.sum()
경북 = 경북중환병상.sum()
경남 = 경남중환병상.sum()
제주 = 제주중환병상.sum()
세종 = 세종중환병상.sum()

중환병상 = pd.DataFrame([서울, 부산, 인천, 대구, 광주, 대전, 울산, 경기, 
                     강원, 충북, 충남, 전북, 전남, 경북, 경남, 제주, 세종])
중환병상.columns = ["중환병상"]
    

x7 = pd.read_excel("C:/Users/USER/Downloads/119_구급_운영_현황_20221220173650.xls")
구급차수 = x7.loc[2:19,"구급차 (대)"]
구급차수.index = 구급차수.index - 2
구급차수[15] = 구급차수[15] + 구급차수[17]
구급차수.iloc[15] = 구급차수[15]
구급차수.drop(17, inplace=True)

x8 = pd.read_excel("C:/Users/USER/Downloads/119_구급대_현황_20221220173712.xls")
구급대원수 = x8.loc[4:22, "2021.2"]
구급대원수.index = 구급대원수.index - 4
구급대원수[15] = 구급대원수[15] + 구급대원수[17]
구급대원수.iloc[15] = 구급대원수[15]
구급대원수.drop(17, inplace=True)


# 데이터 합치기
hos_all = pd.concat([상급종합병원수, 종합병원수, 병원수, 심장혈관흉부외과의원수, 일반의수, 전문의수, 간호사수, 
                     임상병리사수, 심장혈관흉부외과수, 일반병실, 일반병상, 중환병실, 중환병상, 구급차수, 구급대원수],  axis = 1)
    
hos_all['지역']= ["서울", "부산", "인천", "대구", "광주", "대전", "울산", "경기", "강원", "충북", "충남", "전북", "전남", "경북", "경남", "제주", "세종"]
col_list = hos_all.columns.tolist()
new_col_list = col_list[-1:] + col_list[:-1]
print(new_col_list)
hos_all = hos_all[new_col_list]
hos_all.rename(columns = {'2021.2':'구급대원수'}, inplace = True)
hos_all


hos_all.to_csv("C:/Users/USER/Documents/BigDataProject-ProjectName/hos_all.csv")
